buzzwang1/pcb/source/Driver/STM32/L4/HAL/cI2C/v01.01.00/cI2C.h
#ifndef __cI2C_H__
#define __cI2C_H__

#include "Typedef.h"
#include "stm32l4xx.h"
#include "stm32l4xx_hal.h"
#include "stm32l4xx_hal_i2c.h"
#include "stm32l4xx_ll_i2c.h"
#include "stm32l4xx_ll_dma.h"

#include "tGPPin.h"
#include "ComDat.h"
#include "ClockInfo.h"



class cI2c
{
  public:

  cGpPin *mPinSCL;
  cGpPin *mPinSDA;

  DMA_TypeDef* mDma;
  DMA_Channel_TypeDef* mDmaChTx;
  DMA_Channel_TypeDef* mDmaChRx;
  u32                  mu32DmaFlagTcTx;
  u32                  mu32DmaFlagTcRx;

  u32                  mu32Baud;

  I2C_TypeDef   *mI2C;

  IRQn_Type mnNVIC_IRQChannelEv;
  IRQn_Type mnNVIC_IRQChannelEr;

  uint8 mui8Adr1;
  uint8 mui8Adr2;

  cI2c(I2C_TypeDef *lstI2c, cGpPin *lcScl, cGpPin *lcSda, DMA_TypeDef* lDma, DMA_Channel_TypeDef* lDmaChRx, DMA_Channel_TypeDef* lDmaChTx)
  {
    mI2C = lstI2c;

    mPinSCL = lcScl;
    mPinSDA = lcSda;

    mDma = lDma;
    mDmaChTx = lDmaChTx;
    mDmaChRx = lDmaChRx;

    if ((lDmaChTx == DMA1_Channel1) || (lDmaChTx == DMA2_Channel1)) mu32DmaFlagTcTx = DMA_FLAG_TC1;
    if ((lDmaChTx == DMA1_Channel2) || (lDmaChTx == DMA2_Channel2)) mu32DmaFlagTcTx = DMA_FLAG_TC2;
    if ((lDmaChTx == DMA1_Channel3) || (lDmaChTx == DMA2_Channel3)) mu32DmaFlagTcTx = DMA_FLAG_TC3;
    if ((lDmaChTx == DMA1_Channel4) || (lDmaChTx == DMA2_Channel4)) mu32DmaFlagTcTx = DMA_FLAG_TC4;
    if ((lDmaChTx == DMA1_Channel5) || (lDmaChTx == DMA2_Channel5)) mu32DmaFlagTcTx = DMA_FLAG_TC5;
    if ((lDmaChTx == DMA1_Channel6) || (lDmaChTx == DMA2_Channel6)) mu32DmaFlagTcTx = DMA_FLAG_TC6;
    if ((lDmaChTx == DMA1_Channel7) || (lDmaChTx == DMA2_Channel7)) mu32DmaFlagTcTx = DMA_FLAG_TC7;

    if ((lDmaChRx == DMA1_Channel1) || (lDmaChRx == DMA2_Channel1)) mu32DmaFlagTcRx = DMA_FLAG_TC1;
    if ((lDmaChRx == DMA1_Channel2) || (lDmaChRx == DMA2_Channel2)) mu32DmaFlagTcRx = DMA_FLAG_TC2;
    if ((lDmaChRx == DMA1_Channel3) || (lDmaChRx == DMA2_Channel3)) mu32DmaFlagTcRx = DMA_FLAG_TC3;
    if ((lDmaChRx == DMA1_Channel4) || (lDmaChRx == DMA2_Channel4)) mu32DmaFlagTcRx = DMA_FLAG_TC4;
    if ((lDmaChRx == DMA1_Channel5) || (lDmaChRx == DMA2_Channel5)) mu32DmaFlagTcRx = DMA_FLAG_TC5;
    if ((lDmaChRx == DMA1_Channel6) || (lDmaChRx == DMA2_Channel6)) mu32DmaFlagTcRx = DMA_FLAG_TC6;
    if ((lDmaChRx == DMA1_Channel7) || (lDmaChRx == DMA2_Channel7)) mu32DmaFlagTcRx = DMA_FLAG_TC7;
  }

  // vAdrEnable und vAdrDisable sollte nicht während einer
  // laufenden Adressierung ausgeführt werden
  void vAdrEnable()  { LL_I2C_EnableOwnAddress1(mI2C); };
  void vAdrDisable() { LL_I2C_DisableOwnAddress1(mI2C); };
  bool isAdrEnabled() { return LL_I2C_IsEnabledOwnAddress1(mI2C); };

  void vActivateNack() { LL_I2C_AcknowledgeNextData(mI2C, LL_I2C_NACK); };

  void  vSetAdr2(u8 lui8Adr2)
  {
    //GPIOB->BSRR = (1 << 15);

    LL_I2C_DisableOwnAddress2(mI2C);
    if (lui8Adr2)
    {
      mui8Adr2 = lui8Adr2;
      LL_I2C_SetOwnAddress2(mI2C, mui8Adr2, 0);
      LL_I2C_EnableOwnAddress2(mI2C);
    }

    //GPIOB->BSRR = (1 << (16 + 15));
  }

  inline void vStopDMA()
  {
    mDmaChTx->CCR &=  ~DMA_CCR_EN;
    mDmaChRx->CCR &=  ~DMA_CCR_EN;
  }

  // Überprüft, ob sich der DMA counter geändert hat. Um rauszufinden, ob irgendwas empfangen wurde
  u16 u16GetDmaCounterRx()
  {
    return mDmaChRx->CNDTR;
  }

  // Überprüft, ob sich der DMA counter geändert hat. Um rauszufinden, ob irgendwas gesendet wurde
  u16 u16GetDmaCounterTx()
  {
    return mDmaChTx->CNDTR;
  }


  void vStartDMATx(uint8* pBuffer, uint32 BufferSize)
  {
    mDma->IFCR      = mu32DmaFlagTcTx;
    mDmaChTx->CCR  &= ~DMA_CCR_EN;
    mDmaChTx->CNDTR = BufferSize;
    mDmaChTx->CMAR  = (uint32)pBuffer;
    mDmaChTx->CCR  |= DMA_CCR_EN;
  }

  void vFlushRx()
  {
    // In case there is still something in the RX Register
    // Flush RXDR, else DMA will have offset
    if (mI2C->ISR & I2C_ISR_RXNE)
    {
      volatile u8 lu8Dummy = mI2C->RXDR;
      UNUSED(lu8Dummy);
    }
  }

  void vStartDMARx(uint8* pBuffer, uint32 BufferSize)
  {
    vFlushRx();

    mDma->IFCR      = mu32DmaFlagTcRx;
    mDmaChRx->CCR  &= ~DMA_CCR_EN;
    mDmaChRx->CNDTR = BufferSize;
    mDmaChRx->CMAR  = (uint32)pBuffer;
    mDmaChRx->CCR  |= DMA_CCR_EN;
  }

  void  vClearClockLine()
  {
    mPinSCL->vSetMode(GPIO_MODE_OUTPUT_OD);

    //for (u8 lu8t = 0; lu8t < 9; lu8t++)
    {
      cClockInfo::Delay_us(1);
      mPinSCL->vSet0();
      cClockInfo::Delay_us(1);
      mPinSCL->vSet1();
    }

    // Es is immer AF4 egal ob I2C1, I2C2, oder I2C3
    mPinSCL->vSetAF(GPIO_MODE_AF_OD, GPIO_AF4_I2C1);
  }

  u32 u32BaudToRegister()
  {
    // Prepared
    //  - I2C Clock = 16Mhz HSI
    //  - Digital Filter DNF = 2
    //  - Analog Filter on.
    //  - Used CubeI2CTool
    //     - Rise Time = 0
    //     - Fall Time = 0
    //        - Baud =  20.000 => 0x10108EFB
    //        - Baud =  40.000 => 0x10103D84
    //        - Baud =  50.000 => 0x00303BF9
    //        - Baud = 100.000 => 0x2010131D
    //        - Baud = 200.000 => 0x00303BF9
    //        - Baud = 300.000 => 0x00100525
    //        - Baud = 400.000 => 0x00100418
    //
    //
    if (mu32Baud <=  20000) return 0x10108EFB;
    if (mu32Baud <=  40000) return 0x10103D84;
    if (mu32Baud <=  50000) return 0x00303BF9;
    if (mu32Baud <= 100000)  return 0x2010131D;
    if (mu32Baud <= 200000)  return 0x00303BF9;
    if (mu32Baud <= 300000)  return 0x00100525;
    /*if (mu32Baud <= 400000)*/  return 0x00100418;
  }

  u8 isErrorActive()
  {
    uint32 lui32ErrorMask;
    lui32ErrorMask = I2C_ISR_NACKF | I2C_ISR_BERR | I2C_ISR_ARLO | I2C_ISR_OVR | I2C_ISR_PECERR | I2C_ISR_TIMEOUT | I2C_ISR_ALERT;
    if ((mI2C->ISR & lui32ErrorMask)) return 1;
    return 0;
  }


  cComNode::tenError enInitHw(bool lbMaster) // __attribute__((optimize("-O0")))
  {
    I2C_HandleTypeDef lhI2c = {};

    if (mI2C == I2C1) __HAL_RCC_I2C1_CLK_DISABLE();
    if (mI2C == I2C2) __HAL_RCC_I2C2_CLK_DISABLE();
    if (mI2C == I2C3) __HAL_RCC_I2C3_CLK_DISABLE();

    // DMA Rx
    if (mDma == DMA1)
    {
      __HAL_RCC_DMA1_CLK_ENABLE();
    }
    else
    {
      __HAL_RCC_DMA2_CLK_ENABLE();
    }

    vStopDMA();

    //SDA and SCL must be pulled high
    if (lbMaster)
    {
      if (!bCheckPins()) vClearClockLine();
      if (!bCheckPins()) return cComNode::enErDeviceInitErrorPins;
    }

    // Es is immer AF4 egal ob I2C1, I2C2, oder I2C3
    mPinSCL->vSetAF(GPIO_MODE_AF_OD, GPIO_AF4_I2C1);
    mPinSDA->vSetAF(GPIO_MODE_AF_OD, GPIO_AF4_I2C1);


    /* I2C Periph clock enable */
    if (mI2C == I2C1) { __HAL_RCC_I2C1_CLK_ENABLE(); __HAL_RCC_I2C1_CONFIG(RCC_I2C1CLKSOURCE_HSI); } // 16Mhz
    if (mI2C == I2C2) { __HAL_RCC_I2C2_CLK_ENABLE(); __HAL_RCC_I2C2_CONFIG(RCC_I2C2CLKSOURCE_HSI); } // 16Mhz
    if (mI2C == I2C3) { __HAL_RCC_I2C3_CLK_ENABLE(); __HAL_RCC_I2C3_CONFIG(RCC_I2C3CLKSOURCE_HSI); } // 16Mhz

    /* I2C Peripheral Disable */
    LL_I2C_Disable(mI2C);


