buzzwang1/pcb/source/Driver/STM32/L4/HAL/cI2C/v01.01.00/cI2C.h
    /* I2C configuration */
    /* I2C configuration */
    lhI2c.Instance = mI2C;
    lhI2c.Init.Timing          = u32BaudToRegister();
    lhI2c.Init.NoStretchMode   = I2C_NOSTRETCH_DISABLED;
    lhI2c.Init.GeneralCallMode = I2C_GENERALCALL_DISABLED;
    lhI2c.Init.AddressingMode  = I2C_ADDRESSINGMODE_7BIT;
    lhI2c.Init.OwnAddress1     = mui8Adr1 << 1;
    lhI2c.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
    lhI2c.Init.OwnAddress2     = mui8Adr2;
    lhI2c.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
    lhI2c.Init.NoStretchMode   = I2C_NOSTRETCH_DISABLE;


    /* Peripheral clock enable */
    HAL_I2C_Init(&lhI2c);
    HAL_I2CEx_AnalogFilter_Config(&lhI2c, I2C_ANALOGFILTER_ENABLED);
    HAL_I2CEx_DigitalFilter_Config(&lhI2c, 2); // These bits are used to configure the digital noise filter on SDA and SCL input. The digital
                                               // filter, filters spikes with a length of up to DNF[3:0] * t I2CCLK

    if (!lbMaster)
    {
      vSetAdr2(mui8Adr2);
    }

    mI2C->ICR = 0xFFFF;

    LL_I2C_EnableDMAReq_RX(mI2C);
    LL_I2C_EnableDMAReq_TX(mI2C);

    if (isErrorActive())
    {
      return cComNode::enErDeviceInitErrorDevice;
    }

    if (mI2C->ISR & I2C_ISR_BUSY)
    {
      return cComNode::enErDeviceInitErrorBusy;
    }

    if (mI2C == I2C1) mnNVIC_IRQChannelEv = I2C1_EV_IRQn;
    if (mI2C == I2C2) mnNVIC_IRQChannelEv = I2C2_EV_IRQn;
    if (mI2C == I2C3) mnNVIC_IRQChannelEv = I2C3_EV_IRQn;
    /* Set the TIMx priority */
    HAL_NVIC_SetPriority(mnNVIC_IRQChannelEv, 8, 8);
    /* Enable the TIMx global Interrupt */
    HAL_NVIC_EnableIRQ(mnNVIC_IRQChannelEv);


    if (mI2C == I2C1) mnNVIC_IRQChannelEr = I2C1_ER_IRQn;
    if (mI2C == I2C2) mnNVIC_IRQChannelEr = I2C2_ER_IRQn;
    if (mI2C == I2C3) mnNVIC_IRQChannelEr = I2C3_ER_IRQn;
    /* Set the TIMx priority */
    HAL_NVIC_SetPriority(mnNVIC_IRQChannelEr, 8, 8);
    /* Enable the TIMx global Interrupt */
    HAL_NVIC_EnableIRQ(mnNVIC_IRQChannelEr);

    if (lbMaster)
    {
      mI2C->CR1 |= I2C_CR1_ERRIE | I2C_CR1_TCIE | I2C_CR1_STOPIE | I2C_CR1_NACKIE;
    }
    else
    {
      mI2C->CR1 |= I2C_CR1_ERRIE | I2C_CR1_STOPIE | I2C_CR1_ADDRIE;
    }

    // ----------- DMA Rx ---------
    DMA_HandleTypeDef lhDMA = {};

    lhDMA.Instance = mDmaChRx;

    if (mDma == DMA1) lhDMA.Init.Request = DMA_REQUEST_3; // Auf DMA1 ist I2C1, I2C2 und I2C3 auf CS3
    if (mDma == DMA2) lhDMA.Init.Request = DMA_REQUEST_5; // Auf DMA2 ist I2C1 auf CS5

    lhDMA.Init.Direction           = DMA_PERIPH_TO_MEMORY;  // RX
    lhDMA.Init.PeriphInc           = DMA_PINC_DISABLE;
    lhDMA.Init.MemInc              = DMA_MINC_ENABLE;
    lhDMA.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    lhDMA.Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
    lhDMA.Init.Mode                = DMA_NORMAL;
    lhDMA.Init.Priority            = DMA_PRIORITY_LOW;

    HAL_DMA_Init(&lhDMA);

    /* Configure DMA Channel data length */
    lhDMA.Instance->CNDTR = 0;
    /* Configure DMA Channel destination address */
    lhDMA.Instance->CPAR = (uint32_t)&(mI2C->RXDR);
    /* Configure DMA Channel source address */
    lhDMA.Instance->CMAR = 0;


    // DMA Tx
    lhDMA.Instance                 = mDmaChTx;
    lhDMA.Init.Direction           = DMA_MEMORY_TO_PERIPH;

    HAL_DMA_Init(&lhDMA);

    /* Configure DMA Channel data length */
    lhDMA.Instance->CNDTR = 0;
    /* Configure DMA Channel destination address */
    lhDMA.Instance->CPAR = (uint32)&(mI2C->TXDR);
    /* Configure DMA Channel source address */
    lhDMA.Instance->CMAR = 0;

    return cComNode::enNoError;
  }

  void vEnableIrq()
  {
    HAL_NVIC_EnableIRQ(mnNVIC_IRQChannelEv);
    HAL_NVIC_EnableIRQ(mnNVIC_IRQChannelEr);
  }

  void vDisableIrq()
  {
    HAL_NVIC_DisableIRQ(mnNVIC_IRQChannelEv);
    HAL_NVIC_DisableIRQ(mnNVIC_IRQChannelEr);
  }

  void vWaitUntilStop()
  {
    u16 lu8Timeout = 100;
    while ((lu8Timeout) && (!(mI2C->ISR & I2C_ISR_STOPF))) // stop
    {
      lu8Timeout--;
    }
  }

  void vWaitWhileBusy()
  {
    u16 lu8Timeout = 100;
    while ((lu8Timeout) && (mI2C->ISR & I2C_ISR_BUSY))
    {
      lu8Timeout--;
    }
  }

  bool bCheckBusy()
  {
    return (!(mI2C->ISR & I2C_ISR_BUSY));
  }

  bool bCheckPins()
  {
    mPinSCL->vSetMode(GPIO_MODE_INPUT);
    mPinSDA->vSetMode(GPIO_MODE_INPUT);

    //SDA and SCL must be pulled high
    if ((mPinSCL->ui8Get() == 0) || (mPinSDA->ui8Get() == 0))
    {
      return False;
    }
    return True;
  }

  void vClearSTOPandNACK()
  {
    mI2C->ICR = I2C_ICR_STOPCF | I2C_ICR_NACKCF; //Clear Stop and Nack detection flag
  }
};


class cI2cMaster : public cI2c, public cComNodeMasterMulti
{
  public:

  // Für Nachrichten >255 Byte
  uint8               *mpui8ComBuf;
  uint32               mui32ComByteCnt;

  cI2cMaster(I2C_TypeDef *lstI2c, cGpPin *lcScl, cGpPin *lcSda,
             DMA_TypeDef* lDma, DMA_Channel_TypeDef* lDmaChRx,
             DMA_Channel_TypeDef* lDmaChTx,
             u32 lu32Baud = 400000, u16 luInitDelay_ms = 1)
    : cI2c(lstI2c, lcScl, lcSda, lDma, lDmaChRx, lDmaChTx),
      cComNodeMasterMulti(luInitDelay_ms)
  {
    mu32Baud     = lu32Baud;
    mu32Baudrate = lu32Baud;
    mui8Adr1     = mui8Adr2 = 0;
  }

  cComNode::tenError enInitHw() override
  {
    return cI2c::enInitHw(True);
  }

  bool bCheckBusy() override
  {
    return cI2c::bCheckBusy();
  }

  /*
    RXNE:   Receive buffer not empty
    TXIS:   Transmit buffer interrupt status
    STOPF:  Stop detection interrupt flag
    TC/TCR: Transfer Complete/ Transfer complete Reload
    ADDR:   Address matched
    NACKF:  NACK reception
  */
  void I2C_EV_IRQHandler()
  {
    if (mI2C->ISR & I2C_ISR_NACKF)
    {
      vComError();
    }
    else
    {
      vSm(cComNode::tenEvent::enEvIrq);
    }
    vStart();
  }

  /*
    BERR:    Bus error
    ARLO:    Arbitration loss
    OVR:     Overrun/Underrun
    PECERR:  PEC error
    TIMEOUT: Timeout/tLOW error
    ALERT:   SMBus Alert
    Note: NACK is not an ER. It is a EV
  */
  void I2C_ER_IRQHandler()
  {
    vErrorHdl();
  }


  void vResetCom()
  {
    if (mSm != cComNode::tenState::enStIdle)
    {
      // I2C Peripheral Disable
      vStopDMA();
      mI2C->ICR = 0xFFFF;
      mpcActiveMsg   = NULL;
      mpcActiveSlave = NULL;

      mSm    = cComNode::tenState::enStIdle;
      mError = cComNode::enNoError;
    }
  }

