buzzwang1/pcb/source/Driver/STM32/L4/HAL/cI2C/v01.01.00/cI2C.h
    mui8Adr1 = lui8Adr1;
    mui8Adr2 = lui8Adr2;

    mPinSCL = lcScl;
    mPinSDA = lcSda;

    mSm          = cComNode::tenState::enStIdle;
    mu32Baudrate = lu32Baud;
  }

  cComNode::tenError enInitHw() override
  {
    mui8Adr1 = muAdr;
    return cI2c::enInitHw(False);
  }

  bool bCheckBusy() override
  {
    return cI2c::bCheckBusy();
  }

  void vHwStop() override
  {
    LL_I2C_Disable(mI2C);
  }

  void vHwContinue() override
  {
    LL_I2C_Enable(mI2C);
  }

  void vResetCom()
  {
    if (mSm != cComNode::tenState::enStIdle)
    {
      // I2C Peripheral Disable
      LL_I2C_Disable(mI2C);
      vStopDMA();
      mI2C->ICR = 0xFFFF;

      mSm    = cComNode::tenState::enStIdle;
      mError = cComNode::enNoError;
    }
  }

  void vComError() override
  {
    u32 lui32ErrorMask;
    cComNode::tenState lSm = mSm;

    lui32ErrorMask = I2C_ISR_BUSY | I2C_ISR_NACKF | I2C_ISR_BERR | I2C_ISR_ARLO | I2C_ISR_OVR | I2C_ISR_PECERR | I2C_ISR_TIMEOUT | I2C_ISR_ALERT;

    if ((mI2C->ISR & lui32ErrorMask) != 0)
    {
      if      (mI2C->ISR & I2C_ISR_NACKF) mError = cComNode::enErNACK;
      else if (mI2C->ISR & I2C_ISR_BERR)  mError = cComNode::enErBusError;
      else if (mI2C->ISR & I2C_ISR_ARLO)  mError = cComNode::enErArbitrationLost;
      else if (mI2C->ISR & I2C_ISR_OVR)   mError = cComNode::enErOverrun;
      else if (mI2C->ISR & I2C_ISR_BUSY)  mError = cComNode::enErStartWhileBusy;
      else                                mError = cComNode::enErUnknown;
    }

    cComNode::tenError lError = mError;

    vResetCom();

    if (mpcActiveSlave != NULL)
    {
      mpcActiveSlave->vComError(lError, lSm);
    }
  }

  void I2C_EV_IRQHandler()
  {
    vSm(cComNode::tenEvent::enEvIrq);
  }

  void I2C_ER_IRQHandler()
  {
    vErrorHdl();
  }


  void vDone()
  {
    mSm = cComNode::tenState::enStIdle;
    mpcActiveSlave->vComDone();
  }

  void vSm(cComNode::tenEvent lenEvent)  // __attribute__((optimize("-O0")))
  {
    UNUSED(lenEvent);

    u32 lui32ISR = mI2C->ISR;

    switch (mSm)
    {
      case cComNode::tenState::enStIdle:
      {
        //if (!(lui32ISR &I2C_ISR_BUSY))
        {
          switch (lenEvent)
          {
            case cComNode::tenEvent::enEvStart:
            case cComNode::tenEvent::enEvStartSkipAdr:
            case cComNode::tenEvent::enEvStartWait:
            case cComNode::tenState::enStError:
              if ((mpcActiveMsg->isTx()) || (mpcActiveMsg->isRx()))
              {
                //mI2C->ICR = 0xFFFF; // Nicht löschen, weil wenn während der Laufzeit ein AM kommt, dann geht die Info verloren
                if (mpcActiveMsg->isTx())
                {
                  //mpcActiveSlave->vComStart(cComNode::tenEvent::enEvPrepareForTx);
                  vStartDMATx(mpcActiveMsg->mpu8Data, mpcActiveMsg->muLen);
                }
                else
                {
                  //mpcActiveSlave->vComStart(cComNode::tenEvent::enEvPrepareForRx);
                  vStartDMARx(mpcActiveMsg->mpu8Data, mpcActiveMsg->muLen);
                }
                LL_I2C_Enable(mI2C);
                mSm = cComNode::tenState::enStWaitAdress;
              }
              else
              {
                mError = cComNode::enErComNodeDir;
                vComError();
              }
              break;
            case cComNode::tenEvent::enEvIrq:
              mError = cComNode::enErUnknown;
              vComError();
              mI2C->ICR = 0xFFFF;
              break;
            default:
              mI2C->ICR = 0xFFFF;
              break;
          }
        }
      }
      break;

      case cComNode::tenState::enStWaitAdress:
      {
        // Warten auf Start vom Master
        if (lui32ISR & I2C_ISR_ADDR)
        {
          // mpcComNode->mAdr = (lui32ISR >> 16) & 0xFE;
          if ((lui32ISR & I2C_ISR_DIR) /*&& (mpcActiveMsg->isTx())*/)
          {
            mSm = cComNode::tenState::enStEnd;
            mI2C->ICR = I2C_ICR_ADDRCF; //Clear Adress bit, the SCL clock is stretched while the ADDR flag is set
          }
          else if ((!(lui32ISR & I2C_ISR_DIR)) /*&& (mpcActiveMsg->isRx())*/)
          {
            mSm = cComNode::tenState::enStEnd;
            mI2C->ICR = I2C_ICR_ADDRCF; //Clear Adress bit, the SCL clock is stretched while the ADDR flag is set
          }
          else
          {
            mError = cComNode::enErComNodeDir;
            vComError();
          }
        }
      }
      break;

      case cComNode::tenState::enStEnd:
        {
          if (lui32ISR & I2C_ISR_STOPF)
          {
            mSm = cComNode::tenState::enStIdle;
            mI2C->ICR = I2C_ICR_STOPCF | I2C_ICR_NACKCF; //Clear Stop and Nack detection flag

            vDone();

            // Falls mpcComNode->vComDone länger dauert kann in der Zwischenzeit
            // eine neue Anfrage from Master kommen
            // Oder Repeated Start
            if (lui32ISR & I2C_ISR_ADDR)
            {
              // mpcComNode->mAdr = (lui32ISR >> 16) & 0xFE;
              if ((lui32ISR & I2C_ISR_DIR) && (mpcActiveMsg->isTx()))
              {
                mSm = cComNode::tenState::enStEnd;
                mI2C->ICR = I2C_ICR_ADDRCF; //Clear Adress bit, the SCL clock is stretched while the ADDR flag is set
              }
              else if ((!(lui32ISR & I2C_ISR_DIR)) && (mpcActiveMsg->isRx()))
              {
                mSm = cComNode::tenState::enStEnd;
                mI2C->ICR = I2C_ICR_ADDRCF; //Clear Adress bit, the SCL clock is stretched while the ADDR flag is set
              }
              else
              {
                mError = cComNode::enErComNodeDir;
                vComError();
              }
            }
          }
          else if (lenEvent)
          {
            mError = cComNode::enErUnknown;
            vComError();
            mI2C->ICR = 0xFFFF;
          }
        }
        break;
      default:
        break;
    }
  }
};


#endif // __cI2C_H__
